# ExportLinetypeKey Class

---
A key used to represent an item stored in an ExportLinetypeTable.
SystemObject Autodesk.Revit.DBExportLinetypeKey
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class ExportLinetypeKey : IDisposable

    Public Class ExportLinetypeKey
    	Implements IDisposable

    public ref class ExportLinetypeKey : IDisposable

    type ExportLinetypeKey =
        class
            interface IDisposable
        end
The ExportLinetypeKey type exposes the following members.
| Name| Description
---|---|---
| ExportLinetypeKey|  Constructs a new default ExportLinetypeKey.
| ExportLinetypeKey(ExportLinetypeKey)|  Constructs a new copy of the input ExportLinetypeKey object.
| ExportLinetypeKey(String)|  Constructs a new default ExportLinetypeKey using the original line type name as input.
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| OriginalLinetypeName|  The original linetype name.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the ExportLinetypeKey
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace